{
      "cars": [
            {
                  "category": "SUV",
                  "availability": true,
                  "brand": "Toyota",
                  "model": "Yaris-Cross",
                  "model_year": 2022,
                  "mileage": 15000,
                  "fuel_type": "Hybrid",
                  "seats": 5,
                  "price_per_day": 100,
                  "description": "The Toyota Yaris Cross is a compact SUV (Sport Utility Vehicle) manufactured by Toyota, a renowned Japanese automaker. It is based on the popular Toyota Yaris hatchback but designed with SUV characteristics to offer a more rugged and versatile driving experience."
            },
            {
                  "category": "Minivan",
                  "availability": true,
                  "brand": "Kia",
                  "model": "Carnival",
                  "model_year": 2023,
                  "mileage": 5000,
                  "fuel_type": "Petrol",
                  "seats": 8,
                  "price_per_day": 180,
                  "description": "The Kia Carnival is a spacious and versatile minivan that offers comfortable seating for up to 8 passengers. It is designed to provide a smooth and enjoyable driving experience for both the driver and the passengers. The Carnival comes with a host of advanced features and modern technologies, making it an excellent choice for family trips and group outings."
            },
            {
                  "category": "Wagon",
                  "availability": false,
                  "brand": "Toyota",
                  "model": "Auris",
                  "model_year": 2018,
                  "mileage": 15000,
                  "fuel_type": "Diesel",
                  "seats": 5,
                  "price_per_day": 150,
                  "description": "The Toyota Auris is a compact hatchback car model produced by the Japanese automaker Toyota. It is known for its stylish design, reliable performance, and fuel efficiency. The Auris offers a comfortable and spacious interior, making it suitable for both daily commuting and longer trips."
            },
            {
                  "category": "SUV",
                  "availability": true,
                  "brand": "Hyundai",
                  "model": "Tucson",
                  "model_year": 2020,
                  "mileage": 5000,
                  "fuel_type": "Petrol",
                  "seats": 4,
                  "price_per_day": 180,
                  "description": "The Hyundai Tucson is a compact SUV produced by the South Korean automaker Hyundai. It was first introduced in 2004 and has since become one of Hyundai's popular models in the SUV segment. The Tucson offers a combination of stylish design, comfortable interior, and versatile functionality."
            },
            {
                  "category": "SUV",
                  "availability": true,
                  "brand": "Toyota",
                  "model": "RAV4",
                  "model_year": 2017,
                  "mileage": 13000,
                  "fuel_type": "Diesel",
                  "seats": 4,
                  "price_per_day": 160,
                  "description": "The Toyota RAV4 is a compact SUV (Sport Utility Vehicle) that is known for its reliability, versatility, and practicality. It is one of Toyota's most popular and successful models, offering a blend of comfort, performance, and utility."
            },
            {
                  "category": "Wagon",
                  "availability": true,
                  "brand": "Subaru",
                  "model": "Outback",
                  "model_year": 2019,
                  "mileage": 8000,
                  "fuel_type": "Diesel",
                  "seats": 5,
                  "price_per_day": 200,
                  "description": "The Subaru Outback is a popular crossover SUV that combines the ruggedness of an off-road vehicle with the versatility of a station wagon. It is known for its exceptional handling and off-road capabilities, making it a reliable choice for adventurous individuals and families."
            },
            {
                  "category": "SUV",
                  "availability": false,
                  "brand": "Ford",
                  "model": "Explorer",
                  "model_year": 2017,
                  "mileage": 22000,
                  "fuel_type": "Gasoline",
                  "seats": 7,
                  "price_per_day": 150,
                  "description": "The Ford Explorer is a mid-size SUV (Sports Utility Vehicle) that has been in production since 1990. It is one of the most popular SUV models in the United States. The Explorer is known for its spacious interior, comfortable seating, and versatile cargo capacity, making it a practical choice for families and individuals with active lifestyles."
            },
            {
                  "category": "Sedan",
                  "availability": true,
                  "brand": "Audi",
                  "model": "A6",
                  "model_year": 2019,
                  "mileage": 13000,
                  "fuel_type": "Gasoline",
                  "seats": 5,
                  "price_per_day": 200,
                  "description": "The Audi A6 is a luxury sedan produced by the German automobile manufacturer Audi. It is known for its sleek design, advanced technology, and high-quality craftsmanship. The A6 is positioned between the smaller A4 and the larger A8 in Audi's lineup."
            },
            {
                  "category": "Sedan",
                  "availability": true,
                  "brand": "BMW",
                  "model": "740i",
                  "model_year": 2016,
                  "mileage": 18000,
                  "fuel_type": "Gasoline",
                  "seats": 5,
                  "price_per_day": 300,
                  "description": "The BMW 740i is a luxury sedan from the renowned German automaker BMW. It is part of the BMW 7 Series, which represents the pinnacle of elegance, comfort, and performance in the BMW lineup. The 740i is known for its exceptional craftsmanship, cutting-edge technology, and powerful performance."
            },
            {
                  "category": "Hatchback",
                  "availability": false,
                  "brand": "Volkswagen",
                  "model": "Golf GTI",
                  "model_year": 2020,
                  "mileage": 8000,
                  "fuel_type": "Gasoline",
                  "seats": 5,
                  "price_per_day": 120,
                  "description": "The Volkswagen Golf GTI is a high-performance variant of the popular Volkswagen Golf compact car. Known for its sporty and dynamic driving experience, the Golf GTI has gained a strong reputation among enthusiasts and car lovers."
            },
            {
                  "category": "SUV",
                  "availability": true,
                  "brand": "Mercedes-Benz",
                  "model": "GLE",
                  "model_year": 2022,
                  "mileage": 25000,
                  "fuel_type": "Diesel",
                  "seats": 7,
                  "price_per_day": 250,
                  "description": "The Mercedes-Benz GLE is a luxury midsize SUV that offers a combination of elegance, performance, and advanced technology. It is part of the prestigious Mercedes-Benz lineup and embodies the brand's commitment to craftsmanship and innovation."
            },
            {
                  "category": "SUV",
                  "availability": false,
                  "brand": "Jeep",
                  "model": "Grand Cherokee",
                  "model_year": 2018,
                  "mileage": 12000,
                  "fuel_type": "Gasoline",
                  "seats": 5,
                  "price_per_day": 200,
                  "description": "The Jeep Grand Cherokee is a mid-size SUV that has gained popularity for its ruggedness, versatility, and off-road capabilities. It is produced by the American automaker Jeep, a division of Stellantis. The Grand Cherokee has been in production since 1993 and has gone through several generations, with each iteration bringing improvements and updates."
            },
            {
                  "category": "UTE",
                  "availability": true,
                  "brand": "Toyota",
                  "model": "Hilux",
                  "model_year": 2019,
                  "mileage": 15000,
                  "fuel_type": "Diesel",
                  "seats": 5,
                  "price_per_day": 150,
                  "description": "The Toyota Hilux is a popular pickup truck that has gained a reputation for its durability, reliability, and off-road capability. It is manufactured by Toyota, a renowned Japanese automaker. The Hilux is known for its robust construction, making it suitable for various demanding conditions and terrains."
            },
            {
                  "category": "SUV",
                  "availability": true,
                  "brand": "BMW",
                  "model": "X5",
                  "model_year": 2019,
                  "mileage": 13000,
                  "fuel_type": "Gasoline",
                  "seats": 5,
                  "price_per_day": 300,
                  "description": "The BMW X5 is a luxury midsize SUV that offers a blend of elegance, performance, and versatility. As one of BMW's flagship SUVs, the X5 combines a sleek and stylish design with advanced technology and a comfortable interior."
            },
            {
                  "category": "Truck",
                  "availability": true,
                  "brand": "Ford",
                  "model": "F-150",
                  "model_year": 2021,
                  "mileage": 12000,
                  "fuel_type": "Gasoline",
                  "seats": 6,
                  "price_per_day": 180,
                  "description": "The Ford F-150 is a full-size pickup truck that has been one of the best-selling vehicles in the U.S. for decades. Known for its durability and towing capabilities, it offers a range of features for both work and leisure."
            },
            {
                  "category": "Coupe",
                  "availability": true,
                  "brand": "Chevrolet",
                  "model": "Camaro",
                  "model_year": 2020,
                  "mileage": 8000,
                  "fuel_type": "Gasoline",
                  "seats": 4,
                  "price_per_day": 220,
                  "description": "The Chevrolet Camaro is a sporty coupe that delivers exhilarating performance with its muscular design and powerful engine options. It's an iconic American muscle car, perfect for those who enjoy spirited driving."
            },
            {
                  "category": "Convertible",
                  "availability": false,
                  "brand": "Mazda",
                  "model": "MX-5 Miata",
                  "model_year": 2019,
                  "mileage": 10000,
                  "fuel_type": "Gasoline",
                  "seats": 2,
                  "price_per_day": 200,
                  "description": "The Mazda MX-5 Miata is a lightweight convertible that is praised for its nimble handling and classic roadster design. It's a fun-to-drive sports car with a manual transmission that provides a thrilling driving experience."
            },
            {
                  "category": "Electric",
                  "availability": true,
                  "brand": "Tesla",
                  "model": "Model 3",
                  "model_year": 2022,
                  "mileage": 5000,
                  "fuel_type": "Electric",
                  "seats": 5,
                  "price_per_day": 250,
                  "description": "The Tesla Model 3 is an all-electric sedan offering cutting-edge technology, impressive range, and quick acceleration. It is one of Tesla's best-selling models, known for its minimalistic design and autopilot features."
            },
            {
                  "category": "Luxury Sedan",
                  "availability": true,
                  "brand": "Mercedes-Benz",
                  "model": "S-Class",
                  "model_year": 2021,
                  "mileage": 6000,
                  "fuel_type": "Gasoline",
                  "seats": 5,
                  "price_per_day": 400,
                  "description": "The Mercedes-Benz S-Class is a flagship luxury sedan offering unparalleled comfort, advanced safety features, and state-of-the-art technology. It's often considered the pinnacle of luxury in the sedan category."
            },
            {
                  "category": "Hybrid",
                  "availability": false,
                  "brand": "Honda",
                  "model": "Accord Hybrid",
                  "model_year": 2020,
                  "mileage": 15000,
                  "fuel_type": "Hybrid",
                  "seats": 5,
                  "price_per_day": 180,
                  "description": "The Honda Accord Hybrid is a midsize sedan that combines fuel efficiency with Honda's renowned reliability. It offers a comfortable ride and is an eco-friendly option for long-distance commuting."
            },
            {
                  "category": "SUV",
                  "availability": true,
                  "brand": "Land Rover",
                  "model": "Range Rover Evoque",
                  "model_year": 2021,
                  "mileage": 10000,
                  "fuel_type": "Diesel",
                  "seats": 5,
                  "price_per_day": 350,
                  "description": "The Land Rover Range Rover Evoque is a compact luxury SUV that provides a premium driving experience both on and off the road. Its stylish design and powerful performance make it a desirable choice in the luxury SUV segment."
            },
            {
                  "category": "Van",
                  "availability": false,
                  "brand": "Mercedes-Benz",
                  "model": "Sprinter",
                  "model_year": 2022,
                  "mileage": 4000,
                  "fuel_type": "Diesel",
                  "seats": 12,
                  "price_per_day": 280,
                  "description": "The Mercedes-Benz Sprinter is a full-size van known for its versatility and spacious interior, making it ideal for transporting large groups or cargo. It is widely used in commercial applications and offers excellent reliability."
            },
            {
                  "category": "Compact",
                  "availability": true,
                  "brand": "Nissan",
                  "model": "Leaf",
                  "model_year": 2021,
                  "mileage": 9000,
                  "fuel_type": "Electric",
                  "seats": 5,
                  "price_per_day": 170,
                  "description": "The Nissan Leaf is one of the world's best-selling electric cars, offering zero-emission driving and advanced safety features. It's a practical choice for eco-conscious drivers looking for a compact electric vehicle."
            },
            {
                  "category": "SUV",
                  "availability": true,
                  "brand": "Volvo",
                  "model": "XC90",
                  "model_year": 2019,
                  "mileage": 13000,
                  "fuel_type": "Gasoline",
                  "seats": 7,
                  "price_per_day": 300,
                  "description": "The Volvo XC90 is a luxury SUV known for its sophisticated Scandinavian design, advanced safety features, and spacious seating for seven. It is a family-friendly SUV with excellent comfort and technology."
            },
            {
                  "category": "Wagon",
                  "availability": true,
                  "brand": "Audi",
                  "model": "A4 Allroad",
                  "model_year": 2019,
                  "mileage": 10000,
                  "fuel_type": "Diesel",
                  "seats": 5,
                  "price_per_day": 220,
                  "description": "The Audi A4 Allroad is a versatile station wagon that combines the refinement of an Audi sedan with the ruggedness of an off-road vehicle. It's perfect for those who want luxury and functionality in one vehicle."
            },
            {
                  "category": "Convertible",
                  "availability": false,
                  "brand": "Porsche",
                  "model": "911 Carrera",
                  "model_year": 2020,
                  "mileage": 7000,
                  "fuel_type": "Gasoline",
                  "seats": 2,
                  "price_per_day": 500,
                  "description": "The Porsche 911 Carrera is an iconic sports car known for its timeless design, rear-engine layout, and high-performance capabilities. It's a dream car for many driving enthusiasts seeking thrill and precision on the road."
            },
            {
                  "category": "SUV",
                  "availability": true,
                  "brand": "Jeep",
                  "model": "Wrangler",
                  "model_year": 2019,
                  "mileage": 12000,
                  "fuel_type": "Gasoline",
                  "seats": 5,
                  "price_per_day": 230,
                  "description": "The Jeep Wrangler is an iconic off-road SUV that provides exceptional off-roading capabilities, rugged design, and a sense of adventure. It’s the vehicle of choice for those looking to tackle tough terrains."
            },
            {
                  "category": "Hatchback",
                  "availability": true,
                  "brand": "Mini",
                  "model": "Cooper S",
                  "model_year": 2020,
                  "mileage": 10000,
                  "fuel_type": "Gasoline",
                  "seats": 4,
                  "price_per_day": 180,
                  "description": "The Mini Cooper S is a compact hatchback that blends retro styling with a sporty driving experience. It’s known for its go-kart-like handling and fun, energetic vibe, perfect for city driving."
            },
            {
                  "category": "Hybrid",
                  "availability": true,
                  "brand": "Lexus",
                  "model": "RX 450h",
                  "model_year": 2020,
                  "mileage": 11000,
                  "fuel_type": "Hybrid",
                  "seats": 5,
                  "price_per_day": 280,
                  "description": "The Lexus RX 450h is a luxury hybrid SUV that offers a smooth and efficient ride. It combines the comfort and sophistication of Lexus with the eco-friendliness of a hybrid powertrain."
            },
            {
                  "category": "Motorcycle",
                  "availability": true,
                  "brand": "Harley-Davidson",
                  "model": "Sportster Iron 883",
                  "model_year": 2021,
                  "mileage": 5000,
                  "fuel_type": "Gasoline",
                  "seats": 2,
                  "price_per_day": 100,
                  "description": "The Harley-Davidson Sportster Iron 883 is a cruiser motorcycle with a classic design and a powerful V-Twin engine. Known for its rugged look and solid performance, it’s perfect for riders who seek both style and substance."
            },
            {
                  "category": "Motorcycle",
                  "availability": false,
                  "brand": "Yamaha",
                  "model": "MT-07",
                  "model_year": 2020,
                  "mileage": 8000,
                  "fuel_type": "Gasoline",
                  "seats": 2,
                  "price_per_day": 90,
                  "description": "The Yamaha MT-07 is a naked sportbike offering an agile and powerful riding experience. With its lightweight design and responsive engine, it is a favorite among motorcyclists looking for versatility and excitement on the road."
            },
            {
                  "category": "Scooter",
                  "availability": true,
                  "brand": "Honda",
                  "model": "Activa 125",
                  "model_year": 2022,
                  "mileage": 3000,
                  "fuel_type": "Gasoline",
                  "seats": 2,
                  "price_per_day": 40,
                  "description": "The Honda Activa 125 is a popular scooter known for its practicality, fuel efficiency, and smooth ride. It is designed for urban commuting, making it an ideal choice for short-distance travel in the city."
            },
            {
                  "category": "Three-Wheeler Auto",
                  "availability": true,
                  "brand": "Bajaj",
                  "model": "RE Auto",
                  "model_year": 2019,
                  "mileage": 15000,
                  "fuel_type": "CNG",
                  "seats": 3,
                  "price_per_day": 50,
                  "description": "The Bajaj RE Auto is a three-wheeler auto-rickshaw that is widely used for public transport in many cities. Known for its reliability and efficiency, it is powered by a CNG engine, making it an eco-friendly option."
            },
            {
                  "category": "Motorcycle",
                  "availability": true,
                  "brand": "Royal Enfield",
                  "model": "Classic 350",
                  "model_year": 2021,
                  "mileage": 7000,
                  "fuel_type": "Gasoline",
                  "seats": 2,
                  "price_per_day": 110,
                  "description": "The Royal Enfield Classic 350 is a retro-styled motorcycle that combines classic design with modern performance. It is beloved for its thumping engine and comfortable ride, making it a popular choice for long-distance journeys."
            }
      ]
}